{
  "joy": [
    "I'm thrilled for you! 😊",
    "Your happiness is contagious! 🌟",
    "What a wonderful day to be happy!",
    "Happiness looks great on you!",
    "Sending you more reasons to smile today! 😃",
    "The world is brighter with your happiness!",
    "You deserve all the joy in the world. Enjoy it!",
    "Dance like nobody's watching—celebrate your happiness!",
    "Your positivity is a ray of sunshine in my day. ☀️",
    "May your happiness be as endless as the sky!"
  ],
  "sadness": [
    "I'm here for you. If you want to talk, I'm listening. 😢",
    "It's okay to feel sad. Expressing your emotions is important.",
    "Sometimes a good cry can be cathartic. I'm here to support you.",
    "Let's take it one step at a time. You're not alone.",
    "Sadness is temporary; let's find ways to bring some brightness.",
    "Feel your emotions—it's a sign you're alive. I'm here with you.",
    "Your feelings are valid. How can I assist you today?",
    "Take all the time you need to heal. I'm here to support you.",
    "You're stronger than you know. Lean on me for support.",
    "Sending virtual hugs your way. 🤗"
  ],
  "anger": [
    "I understand that you're feeling angry. Let's try to work through it together. 😡",
    "Anger is a natural emotion. What's bothering you?",
    "Take a deep breath. I'm here to help you navigate through your anger.",
    "Channel that anger into positive energy. You've got this!",
    "Expressing anger is healthy. Let's find a constructive outlet.",
    "I'm here to listen without judgment. What's on your mind?",
    "Anger can be a powerful motivator. Let's turn it into action.",
    "Your feelings are valid. How can we address what's bothering you?",
    "You're not alone in your anger. We can find solutions together.",
    "Emotions come and go. Let's find a way to release the tension."
  ],
  "anxiety": [
    "It sounds like you're feeling anxious. Take a deep breath, and let's discuss what's on your mind. 😰",
    "Anxiety can be challenging. What's causing you anxiety?",
    "Remember, it's okay not to be okay. I'm here to support you through moments of anxiety.",
    "Let's break down the sources of anxiety and work on them step by step.",
    "Visualize a calm place; let's find ways to ease your anxiety.",
    "You're stronger than your anxiety. We'll navigate through it together.",
    "Anxiety is temporary. Let's focus on the present moment.",
    "Self-care is key. What activities help you relax?",
    "It's okay to ask for support. I'm here to help you manage anxiety.",
    "Sending calming vibes your way. 🌿"
  ],
  "neutral": [
    "I'm here to chat. Whether you're happy, sad, or anything in between, feel free to share. 😊",
    "Your mood is important. How can I assist you today?",
    "No matter how you're feeling, I'm here for you.",
    "Neutral vibes are cool. Anything on your mind you'd like to discuss?",
    "Let's explore different topics. What interests you right now?",
    "In the world of emotions, neutral is like a calm sea. What's stirring your thoughts?",
    "Feel free to express yourself in any mood. I'm here to listen.",
    "Whether it's highs or lows, your feelings matter. What's on your agenda today?",
    "We all have moments of neutrality. How can I make your day a bit more interesting?",
    "Embracing the neutral vibes today. What's your preferred way to unwind?"
  ],
  "curiosity": [
    "I love curiosity! What are you curious about today?",
    "Curiosity is the spark of learning. What topic has piqued your interest?",
    "Ask away! I'm here to satisfy your curiosity.",
    "Curious minds make the world go round. What would you like to explore?",
    "The quest for knowledge is exciting! What burning questions do you have?",
    "Fueling curiosity leads to discovery. What mysteries are you eager to unravel?",
    "Embrace your curiosity! What fascinating things are on your mind?",
    "Curiosity is the key to continuous growth. What's capturing your attention right now?",
    "In the realm of curiosity, every question is an adventure. What shall we discover today?",
    "Curiosity is contagious! What's inspiring your inquisitive nature?"
  ],
  "patterns": {
    "\\b(?:how\\sare\\syou|what's\\sup)\\b": "I'm here to assist you. How can I help?",
    "\\b(?:thank\\syou|thanks|appreciate)\\b": "You're welcome! If you need anything else, feel free to ask.",
    "\\b(?:tell\\sme\\sajoke|joke)\\b": "Sure, here's a joke for you: [insert joke]",
    "\\b(?:tell\\sme\\sastory|story)\\b": "Once upon a time... What kind of story are you in the mood for?",
    "\\b(?:how\\sto\\srelax|relaxation\\stips)\\b": "Relaxation is important! Try taking deep breaths or listening to calming music.",
    "\\b(?:what\\sdo\\syou\\sthink|your\\sopinion)\\b": "I don't have personal opinions, but would love to listen to yours. How can I help you today?",
    "\\b(?:favorite\\sactivity|hobby)\\b": "I don't have hobbies, but I'd love to hear about yours! What do you enjoy doing?",
    "\\b(?:your\\sname|what\\sdo\\sI\\scall\\syou)\\b": "You can call me ChatBot! How can I assist you today?",
    "\\b(?:weather\\slike\\stoday|forecast)\\b": "I don't have access to real-time data, but I can chat with you about the weather! What's it like where you are?",
    "\\b(?:your\\sage|how\\sold\\sare\\syou)\\b": "I don't have an age. I'm here to help regardless! What can I do for you?",
    "\\b(?:good\\smorning|good\\safternoon|good\\sevening)\\b": "Good [time of day]! How can I brighten your day?",
    "\\b(?:music\\srecommendation|favorite\\ssong)\\b": "I don't have personal preferences, but I can suggest music based on your mood! What kind of music are you in the mood for?",
    "\\b(?:fun\\sfact|interesting\\sfact)\\b": "Sure, here's an interesting fact: [insert fact]",
    "\\b(?:compliment\\sme|say\\snice\\sthings)\\b": "You're amazing just the way you are! Anything specific you'd like to talk about?",
    "\\b(?:weekend\\splans|upcoming\\sevents)\\b": "Any exciting plans for the weekend or upcoming events? I'd love to hear about them!",
    "\\b(?:book\\srecommendation|favorite\\sbook)\\b": "I don't have personal favorites, but I can recommend books based on your interests! What genres do you enjoy?",
    "\\b(?:tell\\sme\\sabout\\syourself)\\b": "I'm just a friendly chatbot here to assist you! Is there something specific you'd like to know or talk about?",
    "\\b(?:how\\sdo\\sI\\s(?:overcome|deal\\swith)\\sstress)\\b": "Dealing with stress is important. Taking breaks, talking to friends, and practicing mindfulness can help.",
    "\\b(?:what\\sis\\sthe\\smeaning\\sof\\slife)\\b": "The meaning of life is a subjective question. What does it mean to you?",
    "\\b(?:what\\s\\w+\\smovie\\sshould\\sI\\swatch)\\b": "I can recommend movies based on your preferences. What genre are you in the mood for?",
    "\\b(?:how\\s\\w+\\sI\\s\\w+\\smy\\s\\w+)\\b": "I can provide guidance. What specific [subject] are you looking to [action]?",
    "\\b(?:where\\scan\\s\\w+\\s\\w+)\\b": "I can help you find [place]. What [place] are you looking for?",
    "\\b(?:can\\s\\w+\\s\\w+\\s\\w+\\s\\w+\\sme)\\b": "I can certainly [action]. What [action] are you looking to [action]?",
    "\\b(?:tell\\sme\\sabout\\s\\w+)\\b": "I'd be happy to share information about [topic]. What specific details are you interested in?"
  },
  "remedies": {
    "joy": [
      "Spread the joy! Share a compliment with someone today.",
      "Engage in activities that bring you joy and make you laugh.",
      "Express gratitude for the positive aspects of your life.",
      "Listen to uplifting music to enhance your joyful mood.",
      "Take a moment to savor the good things happening around you.",
      "Connect with friends or loved ones to share your happiness.",
      "Practice mindfulness and focus on the present moment.",
      "Indulge in a treat or activity that brings you a sense of joy.",
      "Celebrate your achievements, no matter how small.",
      "Find beauty in the simple pleasures of life."
    ],
    "sadness": [
      "Allow yourself to feel and acknowledge your emotions.",
      "Reach out to a friend or family member for support.",
      "Engage in activities that bring comfort and solace.",
      "Write down your thoughts and feelings to release emotional tension.",
      "Create a self-care routine to nurture your mental well-being.",
      "Watch a heartwarming movie or read a book that resonates with you.",
      "Take a walk in nature to clear your mind and uplift your spirits.",
      "Consider talking to a mental health professional if needed.",
      "Focus on positive affirmations to shift your mindset.",
      "Remember that it's okay not to be okay; healing takes time."
    ],
    "anger": [
      "Practice deep breathing exercises to calm your body and mind.",
      "Engage in physical activity to release built-up tension.",
      "Express your feelings through writing or art to channel anger.",
      "Take a break from the situation to gain perspective.",
      "Use positive affirmations to redirect your thoughts.",
      "Consider the other person's point of view to promote understanding.",
      "Seek healthy outlets for frustration, such as talking to a friend.",
      "Practice forgiveness to release the emotional burden.",
      "Focus on solutions rather than dwelling on the source of anger.",
      "Remember that you have the power to choose how you respond."
    ],
    "anxiety": [
      "Practice deep and mindful breathing to alleviate anxiety symptoms.",
      "Identify and challenge anxious thoughts through self-reflection.",
      "Create a calming routine or ritual to reduce stress.",
      "Engage in physical exercise to release tension and boost mood.",
      "Limit exposure to stressors and create a supportive environment.",
      "Consider mindfulness meditation to stay present and centered.",
      "Establish a consistent sleep routine to promote overall well-being.",
      "Set realistic goals and prioritize tasks to reduce overwhelm.",
      "Reach out to a trusted friend or professional for support.",
      "Remember that anxiety is manageable, and you are not alone."
    ]
  }
}
